Белгипрозем_2017/src/InformationRegisters/НастройкиУведомленияОкончанияСрокаДействия/НастройкиУведомленияОкончанияСрокаДействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУведомленияОкончанияСрокаДействия</name>
  <resources>
    <name>СрокУведомления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧастотаУведомления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/НастройкиУведомленияОкончанияСрокаДействия/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает настройку пользователя уведомления о сроке задачи
Функция ПолучитьНастройку(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиУведомленияОкончанияСрокаДействия.СрокУведомления,
	|	НастройкиУведомленияОкончанияСрокаДействия.ЧастотаУведомления
	|ИЗ
	|	РегистрСведений.НастройкиУведомленияОкончанияСрокаДействия КАК НастройкиУведомленияОкончанияСрокаДействия
	|ГДЕ
	|	НастройкиУведомленияОкончанияСрокаДействия.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		НастройкаУведомлений = 
			Новый Структура("СрокУведомления, ЧастотаУведомления",
			Выборка.СрокУведомления,
			Выборка.ЧастотаУведомления);
		
		Возврат НастройкаУведомлений;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Записывает настройку уведомления о сроке задачи
Процедура СохранитьНастройку(Пользователь, СрокУведомления, ЧастотаУведомления) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.НастройкиУведомленияОкончанияСрокаДействия.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	Запись.Прочитать();
	
	Запись.Пользователь = Пользователь;
	Запись.СрокУведомления = СрокУведомления;
	Запись.ЧастотаУведомления = ЧастотаУведомления;
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
